Revit 2022 API
StructuralSettings.AnalyticalModelAutoCheckConsistency Property
 Whether to check automatically for consistency between the analytical and physical models.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public bool AnalyticalModelAutoCheckConsistency { get; set; }
Visual Basic
Public Property AnalyticalModelAutoCheckConsistency As Boolean
	Get
	Set
Visual C++
public:
property bool AnalyticalModelAutoCheckConsistency {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace